Revit 2026 API

# InstanceVoidCutUtilsRemoveInstanceVoidCut Method

---

Remove a cut applied to the element by a cutting instance with unattached voids.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void RemoveInstanceVoidCut(
	Document document,
	Element element,
	Element cuttingInstance
)
```
```vb
Public Shared Sub RemoveInstanceVoidCut (
	document As Document,
	element As Element,
	cuttingInstance As Element
)
```
```cpp
public:
static void RemoveInstanceVoidCut(
	Document^ document,
	Element^ element,
	Element^ cuttingInstance
)
```
```fsharp
static member RemoveInstanceVoidCut :
        document : Document *
        element : Element *
        cuttingInstance : Element -> unit
```

#### Parameters

document Document
     The document containing the two elements
element Element
     The element being cut
cuttingInstance Element
     The cutting family instance

| Exception | Condition |
| --- | --- |
| ArgumentException | No instance void cut exists between the two elements. |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | Failed to remove the instance cut from the element |

#### Reference

InstanceVoidCutUtils Class

Autodesk.Revit.DB Namespace